---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForBuilding
source: html/c4eeddff-9cb0-27cf-734d-c24ab2fbbb04.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSchemaSettingForBuilding Property

"Color Scheme"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSchemaSettingForBuilding { get; }
```